{
  "backend/main.mo": "Main Motoko actor defining all types, persistent state stores, and business logic for the Left2Lift food donation platform, including role-based access, spoilage prediction, NGO matching, donation lifecycle management, and system analytics.",
  "backend/migration.mo": "Migration module that transforms old actor state to the new schema, adding fields like `city` to donations, introducing the `volunteer` role, and mapping all legacy types to their updated equivalents.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (home page, donate food page, etc.) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing short descriptions of key frontend source files, summarizing bug fixes and feature additions made to each component or hook.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point for the Left2Lift React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that handles authentication state, profile loading, and role-based routing to HotelPanel, NGOPanel, or AdminPanel, with fallbacks for login and role selection screens.",
  "frontend/src/components/admin/AdminFoodSafetyMonitoring.tsx": "Admin table view of all donations showing food safety status (safe/unsafe) with inline status dropdowns that allow admins to update each donation's status.",
  "frontend/src/components/admin/AdminSystemAnalytics.tsx": "Admin dashboard panel displaying platform-wide metrics (kg redistributed, total users, donations, waste reduced, and estimated people fed) in a card grid.",
  "frontend/src/components/admin/AdminUserManagement.tsx": "Admin panel listing all registered hotels and NGOs in separate tables with user counts and a deactivate action per user.",
  "frontend/src/components/donation/NGOMatchCard.tsx": "Card component that displays the best-matched NGO for a donation, showing the NGO name, area, distance, and estimated pickup time with a loading skeleton state.",
  "frontend/src/components/donation/RoutePreview.tsx": "Displays a route preview card showing pickup and delivery addresses with an embedded OpenStreetMap iframe centered on a Maharashtra city, plus a link to the full map.",
  "frontend/src/components/donation/SafetyBadge.tsx": "Renders a color-coded badge (green/yellow/red) indicating food safety status with remaining hours and an AI food safety engine attribution.",
  "frontend/src/components/EmergencyBanner.tsx": "Fixed top banner component that displays an animated emergency alert when emergency mode is active, with a dismiss button to deactivate it.",
  "frontend/src/components/hotel/HotelDashboard.tsx": "Shows a hotel donor's dashboard with summary metric cards (total donations, kg donated, completed deliveries, people fed) and a sortable donation history table.",
  "frontend/src/components/hotel/HotelDonationForm.tsx": "Provides a form for hotels to submit food donations with fields for food type, quantity, storage condition, and pickup details, then displays a safety and NGO-match result card.",
  "frontend/src/components/impact/AnimatedStatCard.tsx": "Displays a single statistic with an animated count-up effect over 2 seconds, supporting optional unit and decimal formatting.",
  "frontend/src/components/impact/CityBreakdownChart.tsx": "Renders a horizontal bar chart of food redistribution (kg) per Maharashtra city, falling back to demo data when real totals are zero.",
  "frontend/src/components/impact/LeaderboardTable.tsx": "Displays a static leaderboard table of top food donors across Maharashtra cities with rank icons (crown/medal/award) and total kg donated.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header showing the Left2Lift logo, user role badge, display name, and logout button, plus a footer with attribution links.",
  "frontend/src/components/ngo/MapPreviewCard.tsx": "Shows a compact route preview card for NGOs with from/to addresses and an embedded OpenStreetMap iframe centered on the relevant Maharashtra city.",
  "frontend/src/components/ngo/NGODashboard.tsx": "Displays an NGO dashboard with summary metrics (donations received, total kg, people served) and a full donation history table, fetching data via React Query hooks.",
  "frontend/src/components/ngo/NGODonationRequests.tsx": "Renders individual donation request cards for NGOs with accept/reject actions, urgency/expiry indicators, hotel profile lookup, and an inline feedback form for completed donations.",
  "frontend/src/components/ngo/NGODonationRequestsView.tsx": "Lists active NGO donation requests with food safety scoring, emergency-mode priority sorting, expandable detail cards, and accept/reject mutation handlers.",
  "frontend/src/components/ngo/NGOFeedbackForm.tsx": "A form component that allows NGOs to submit a star rating and optional comment for a completed donation via the submitFeedback mutation.",
  "frontend/src/components/ngo/NGOMetrics.tsx": "Displays animated summary metric cards (total donations, kg received, people served) computed from a list of NGO donations.",
  "frontend/src/components/ngo/NGOProfileForm.tsx": "A form for registering or updating an NGO profile, collecting organization name, location, daily capacity, and food type preferences, then submitting via the registerNGO mutation.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Onboarding screen that lets new users pick a role (Hotel, NGO, or Admin) and enter a display name, then saves the profile via a mutation hook.",
  "frontend/src/components/volunteer/AssignmentCard.tsx": "Renders a volunteer assignment card for a donation, showing food type, quantity, pickup address, countdown timer, safety badge, and action buttons to mark pickup or delivery based on donation status.",
  "frontend/src/components/volunteer/UrgentBanner.tsx": "Displays animated red alert banners for urgent food pickup assignments, showing area, meal count, and hours remaining for each urgent item.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAppTheme.tsx": "Provides a React context and hook for managing light/dark theme state, persisting the preference to localStorage and toggling the 'dark' class on the document root.",
  "frontend/src/hooks/useCityContext.tsx": "Provides a React context and hook for managing the selected city state, persisting the value to sessionStorage.",
  "frontend/src/hooks/useCountdown.ts": "Custom hook that computes and updates a countdown (hours and minutes remaining) from a nanosecond-precision expiry timestamp, refreshing every minute.",
  "frontend/src/hooks/useEmergencyMode.tsx": "Provides a React context and hook for toggling emergency mode state, persisting the boolean value to sessionStorage.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Custom hook that fetches the current authenticated user's profile from the backend actor using React Query, combining actor loading state with query loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, providing a React context and hook with login, logout, and identity state management including delegation validity checks.",
  "frontend/src/hooks/useLanguage.tsx": "Provides a React context and hook for managing the active UI language, persisting the selection to localStorage and exposing a translation helper function.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, including user profiles, donations, NGO/hotel/volunteer assignments, and system analytics.",
  "frontend/src/hooks/useToast.tsx": "Provides a React context, provider, and hook for displaying auto-dismissing toast notifications (success, error, info) rendered in a fixed bottom-right overlay.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind directives, defines CSS custom properties for light/dark themes using oklch colors, and declares reusable component classes like glass-card, emergency badges, and keyframe animations.",
  "frontend/src/lib/foodSafetyEngine.ts": "Pure utility that calculates food safety status (Safe/Urgent/Unsafe) based on storage condition, food type perishability, time since cooking, and Maharashtra city heat factors, returning remaining hours and a badge class.",
  "frontend/src/lib/ngoMatchingEngine.ts": "Contains a static dataset of Maharashtra NGOs and city centers, a Haversine distance function, and a findNearestNGO function that scores and returns the best NGO match based on proximity, urgency, and capacity.",
  "frontend/src/lib/speechUtils.ts": "Provides browser speech recognition (startVoiceRecognition), a parser to extract food type, quantity, and time from voice transcripts (parseDonateSpeech), and a text-to-speech function for impact summaries (speakImpactSummary).",
  "frontend/src/lib/translations.ts": "Defines a multilingual translation map for English, Hindi, and Marathi covering all UI strings including navigation, food types, form labels, and status values.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging (cn), formatting enums (food type, storage condition, donation status), status color mapping, and timestamp/nanosecond conversions.",
  "frontend/src/main.tsx": "React app entry point that mounts the root with QueryClientProvider, InternetIdentityProvider, and the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin page component that renders a tabbed layout with three sections: system analytics, user management, and food safety monitoring, each backed by a dedicated sub-component.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with animated stats, city selector, and voice input that parses speech to pre-fill the donation form and navigate to it.",
  "frontend/src/pages/HotelPanel.tsx": "Hotel user dashboard page with two tabs: a new donation form and a dashboard view for tracking past donations and impact.",
  "frontend/src/pages/LoginScreen.tsx": "Authentication page that displays the Left2Lift branding and feature highlights alongside an Internet Identity login card.",
  "frontend/src/pages/NGOPanel.tsx": "NGO dashboard page that shows a profile setup form if no profile exists, otherwise renders tabs for donation requests, dashboard stats, and profile editing.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, with helpers for persisting values in sessionStorage and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based green/orange color palettes, Poppins/Inter fonts, glass-effect shadows, and slide/fade animations.",
  "project_state.json": "Tracks the full project state (version 5) for 'From Waste to Plate – Maharashtra Edition', an AI-powered food redistribution platform. Contains architectural notes, feature list, tech stack details, design rules, known issues, and image requirements."
}