{
  "backend/main.mo": "Main Motoko actor defining types, persistent state, and business logic for a food redistribution platform including donation management, NGO matching, spoilage prediction, and role-based access control for hotels, NGOs, and admins.",
  "feature_evidence.json": "JSON report mapping feature IDs to their titles, associated source files, component dependencies, and test IDs for the Left2Lift platform features including authentication, hotel panel, and NGO profile registration.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of key frontend source files, noting specific bug fixes such as React hooks misuse and Tailwind class replacements applied in each file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens including background, foreground, primary, secondary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Left2Lift React app, mounting the root div and loading the main TypeScript module entry point.",
  "frontend/src/App.tsx": "Root React component that handles authentication state, profile loading, and role-based routing, rendering LoginScreen, RoleSelectionScreen, or the appropriate role panel (Hotel, NGO, Admin).",
  "frontend/src/components/admin/AdminFoodSafetyMonitoring.tsx": "Admin component that lists all donations in a table with food safety status (safe/unsafe), allowing admins to update donation statuses via a dropdown. Fetches hotel profiles to display hotel names alongside each donation row.",
  "frontend/src/components/admin/AdminSystemAnalytics.tsx": "Admin dashboard component displaying platform-wide metrics (kg redistributed, total users, donations, waste reduced, estimated people fed) fetched from the system analytics hook, with loading skeletons.",
  "frontend/src/components/admin/AdminUserManagement.tsx": "Admin component that lists all registered hotels and NGOs in separate tables with their status, and allows admins to deactivate users via a confirmation prompt.",
  "frontend/src/components/hotel/HotelDashboard.tsx": "Hotel-facing dashboard showing summary metrics (total donations, kg donated, completed deliveries, estimated people fed) and a sortable donation history table with status badges.",
  "frontend/src/components/hotel/HotelDonationForm.tsx": "Form component for hotels to submit food donations, collecting food type, quantity, storage condition, pickup address, and deadline, then displaying a spoilage-safety result and NGO match status after submission.",
  "frontend/src/components/Layout.tsx": "Shared layout wrapper providing a sticky header with logo, role badge, user display name, logout button, and a footer with branding for all authenticated panel pages.",
  "frontend/src/components/ngo/NGODashboard.tsx": "Displays an NGO dashboard with summary metrics (donations received, total kg, people served) and a full donation history table, fetching data via React Query hooks.",
  "frontend/src/components/ngo/NGODonationRequests.tsx": "Renders a list of donation request cards for an NGO, supporting accept/reject actions and displaying urgency/expiry states, with an embedded feedback form for completed donations.",
  "frontend/src/components/ngo/NGOFeedbackForm.tsx": "A form component that allows NGOs to submit a star rating and optional comment for a completed donation using the submitFeedback mutation.",
  "frontend/src/components/ngo/NGOProfileForm.tsx": "A form for registering or updating an NGO profile, collecting organization name, address, daily capacity, and food type preferences, then submitting via the registerNGO mutation.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Two-step first-login screen where new users select a role (Hotel, NGO, Admin) and enter a display name, then save the profile to the backend via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the currently authenticated caller's user profile from the backend actor, gating the query until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including hotel/NGO profile management, donation submission, acceptance, and admin operations using the actor pattern.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Inter/Poppins fonts, and defines a green/orange OKLCH-based design token theme for both light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging (cn), formatting enums (food type, storage condition, donation status), status color mapping, and timestamp/date conversion helpers.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Admin page with three tabs (Analytics, Users, Food Safety) rendering the corresponding admin sub-components inside a shared Layout.",
  "frontend/src/pages/HotelPanel.tsx": "Hotel page with two tabs (New Donation form and Dashboard) for hotels to submit and track food donations.",
  "frontend/src/pages/LoginScreen.tsx": "Landing/login page showcasing the Left2Lift brand with a hero section and an Internet Identity login button, handling already-authenticated edge cases.",
  "frontend/src/pages/NGOPanel.tsx": "NGO page that shows a profile setup form if no profile exists, otherwise renders tabs for Donation Requests, Dashboard, and Profile editing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (green/orange primary/secondary using oklch), typography, border radius, box shadows, keyframe animations, and plugin setup for the Left2Lift frontend.",
  "project_state.json": "Project state manifest for Left2Lift, documenting architecture, tech stack, existing features, known issues, and design constraints for a full-stack AI-powered food redistribution platform."
}