{
  "kind": "build_request",
  "title": "From Waste to Plate – Maharashtra Edition: Full Hackathon Platform Build",
  "projectName": "From Waste to Plate",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Build a Home page with: (1) an animated hero section displaying the tagline 'From waste to plate — powered by AI, delivered with dignity', glassmorphism card styling, and food/impact iconography; (2) a Maharashtra city selector (Mumbai, Pune, Nagpur, Nashik, Aurangabad, Kolhapur) that sets the active city context used throughout the app; (3) live impact counters animating up for Meals Saved, People Fed, and CO₂ Reduced (seeded with realistic demo values); (4) two CTA buttons — 'Donate Food' and 'I Am an NGO'; (5) a voice mic button using Web Speech API that accepts spoken donation intent and pre-fills the Donate Food form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Animated hero section",
          "Voice mic button",
          "CTA buttons",
          "Live counters: Meals Saved, People Fed, CO₂ Reduced",
          "Maharashtra city selector"
        ]
      },
      "acceptanceCriteria": [
        "Hero section renders with tagline and glassmorphism styling",
        "City selector shows all 6 Maharashtra cities and persists selection in app state",
        "Live counters animate from 0 to seeded demo values on page load",
        "CTA buttons navigate to Donate Food page and NGO section",
        "Voice mic button triggers Web Speech API and pre-fills form fields on recognition"
      ]
    },
    {
      "id": "REQ-16",
      "text": "Build a Donate Food page with: (1) a form collecting food type (dropdown: Rice, Curry, Bread, Desserts, Vegetables, Fish, Dairy, Other), quantity in kg, time since cooked (hours), storage condition (Refrigerated, Room Temperature, Hot), pickup address (text with Maharashtra area suggestions from demo data — Andheri East, Dadar West, Bandra Kurla Complex, FC Road, Hinjewadi, Kothrud, Sitabuldi, Wardha Road, Dharampeth), and city selector; (2) voice input toggle that populates form fields via Web Speech API; (3) on submit: display an AI safety badge (Safe/Urgent/Unsafe) with remaining hours text (e.g. 'Safe for 4.5 more hours'), an animated NGO matching result card showing nearest NGO name, distance (km), and estimated pickup time (minutes), and a route preview section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Donate Food",
          "Auto-detect location",
          "Voice input",
          "After submit: AI safety badge, Animated NGO matching, Route preview"
        ]
      },
      "acceptanceCriteria": [
        "Form collects all required fields including city and pickup address",
        "Voice input button activates Web Speech API and fills form fields",
        "On submit, AI safety badge displays with color coding (green/yellow/red) and remaining hours",
        "NGO match card shows NGO name, distance in km, and estimated pickup time",
        "Route preview section renders after successful submission"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Implement a frontend-only AI Food Safety Engine (pure TypeScript logic, no external API). Inputs: food type, quantity, time since cooked (hours), storage condition, and city (used to apply Maharashtra climate factor). Logic: base expiry thresholds — Refrigerated: 24h, Room Temperature: 6h, Hot: 4h. Reduce threshold by 2h for highly perishable types (Fish, Dairy). Apply a climate factor: cities with high summer temperatures (Mumbai, Nashik, Aurangabad, Nagpur) reduce threshold by an additional 0.5h. Compute remaining safe hours = threshold - timeSinceCooked. Classify status: Safe (>=3h remaining), Urgent (1–3h), Unsafe (<1h). Return status label, remaining hours string (e.g. 'Safe for 4.5 more hours'), and a color badge class.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "AI Food Safety Engine",
          "Calculate expiry window",
          "Apply Maharashtra climate factor",
          "Mark food status: Safe, Urgent, Unsafe",
          "Display: Safe for 4.5 more hours"
        ]
      },
      "acceptanceCriteria": [
        "Refrigerated food returns safe for up to 24h (22h for Fish/Dairy)",
        "Room Temperature food returns safe for up to 6h (4h for Fish/Dairy)",
        "Hot food returns safe for up to 4h (2h for Fish/Dairy)",
        "Mumbai/Nashik/Aurangabad/Nagpur reduce threshold by 0.5h as climate factor",
        "Status badges render green for Safe, yellow for Urgent, red for Unsafe",
        "Remaining hours string displays correctly"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement a Smart Nearest Trust Finder in the frontend using hardcoded Maharashtra NGO sample data with coordinates. NGO data: Mumbai — Robin Hood Army (Andheri, lat:19.1136, lng:72.8697), Roti Bank (Dadar, lat:19.0176, lng:72.8422), Feeding India (Bandra, lat:19.0544, lng:72.8402); Pune — Annadaan Foundation (Kothrud, lat:18.5018, lng:73.8077), Seva Sahayog (Shivajinagar, lat:18.5308, lng:73.8474); Nagpur — Bhojan Seva Trust (Dharampeth, lat:21.1458, lng:79.0882), Green Nagpur NGO (Sitabuldi, lat:21.1497, lng:79.0809). Logic: use the Haversine formula to compute distance from donor's city area coordinates to each NGO. Compute urgency score = (remainingHours × 0.4) + ((1/distanceKm) × 0.4) + (capacityScore × 0.2). Select the NGO with the highest urgency score. Display: 'Nearest trust found X.X km away – Estimated pickup in YY minutes' (estimate: distance / 0.5 km/min).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Smart Nearest Trust Finder",
          "Haversine formula",
          "Urgency Score = (Remaining Hours × Weight) + (Distance × Weight) + (NGO Capacity Score)",
          "Nearest trust found 2.3 km away – Estimated pickup in 18 minutes"
        ]
      },
      "acceptanceCriteria": [
        "All 7 hardcoded NGOs with correct city and coordinates are present",
        "Haversine formula correctly calculates distance between two lat/lng points",
        "Urgency score formula applies all three weighted components",
        "Nearest NGO result shows name, distance (1 decimal), and estimated pickup minutes",
        "Result updates when donation form city or food type changes"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Build an enhanced NGO Dashboard page (replacing or extending the existing NGOPanel) with: (1) Donation Requests view showing cards with food type, quantity, food safety status badge (from AI engine), remaining safe hours countdown, hotel name, pickup address, distance from NGO, Accept/Reject buttons; (2) a priority badge on urgent/unsafe donations; (3) an embedded map preview placeholder showing a static route card (OpenStreetMap tile iframe or styled placeholder); (4) NGO metrics: total donations received, total kg, people served (kg × 2.5); (5) donation history table with date, hotel name, food type, quantity, status columns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "NGO Dashboard",
          "Incoming donation cards",
          "Accept/Reject",
          "Priority badge",
          "Distance shown",
          "Map preview"
        ]
      },
      "acceptanceCriteria": [
        "Donation request cards show all fields including safety badge and remaining hours",
        "Priority badge appears on Urgent and Unsafe donations",
        "Accept/Reject buttons call backend and immediately update card status",
        "Map preview section renders for accepted donations",
        "NGO metrics show correct aggregated values"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Build a Volunteer Dashboard page accessible from the main navigation. Show: (1) a list of pickup assignment cards, each with donor name/address, food type, quantity, urgency color coding (green/yellow/red border), a countdown timer showing time until food expires, and a route button; (2) a smart assignment note showing why this volunteer was selected (proximity-based); (3) urgent pickup notification banners at the top (e.g. 'Urgent food pickup near Andheri East. 15 meals expiring in 2 hours.') for Urgent/Unsafe donations; (4) a status update button (Mark as Picked Up, Mark as Delivered). Populate with realistic demo assignment data for Mumbai/Pune/Nagpur areas.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Volunteer Dashboard",
          "Pickup assignments",
          "Route",
          "Countdown timer",
          "Urgency color",
          "Urgent food pickup near Andheri East. 15 meals expiring in 2 hours."
        ]
      },
      "acceptanceCriteria": [
        "Volunteer dashboard page is accessible from navigation",
        "Assignment cards show all fields with urgency color borders",
        "Countdown timer updates in real-time showing time remaining until expiry",
        "Urgent notification banners appear for Urgent/Unsafe assignments",
        "Demo data includes realistic Maharashtra addresses"
      ]
    },
    {
      "id": "REQ-21",
      "text": "Build an Impact Dashboard page with: (1) animated stat cards for total meals rescued, total kg redistributed, CO₂ saved (kg × 2.1 estimate), and total people fed; (2) a city-wise breakdown chart (bar or donut) showing donations by Maharashtra city (Mumbai, Pune, Nagpur, Nashik, Aurangabad, Kolhapur) using seeded demo data; (3) a top donors leaderboard table showing donor name, city, total kg donated, and a badge for top contributor; (4) an AI voice summary button that uses Web Speech API (speechSynthesis) to speak a summary like 'Today in Pune, 312 meals were saved, helping over 780 people.'; (5) animated chart transitions on page load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Impact Dashboard",
          "Animated charts: Total meals rescued, City-wise breakdown, CO₂ saved",
          "Top donors leaderboard",
          "AI voice summary: Today in Pune, 312 meals were saved."
        ]
      },
      "acceptanceCriteria": [
        "All four stat cards animate from 0 to target value on mount",
        "City-wise chart renders with data for all 6 Maharashtra cities",
        "Leaderboard table shows at least 5 demo donor entries with correct columns",
        "Voice summary button triggers speechSynthesis with city-specific text",
        "Charts use green/orange color palette consistent with app theme"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Implement Emergency Mode as a global toggle accessible from the header navigation. When activated: (1) the entire UI shifts to a red-accented theme (red header, red card borders, red status indicators); (2) all active donations are visually flagged as Priority Override; (3) a persistent full-width red banner displays 'HUNGER EMERGENCY MODE ACTIVE – All volunteers notified'; (4) all Urgent/Unsafe donation cards in the NGO and Volunteer dashboards float to the top of their lists; (5) the toggle persists in React state for the session. Deactivating restores the normal green/orange theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Emergency Mode",
          "Toggle: Activate Hunger Emergency Mode",
          "When active: UI turns red, Priority override, Broadcast to all volunteers"
        ]
      },
      "acceptanceCriteria": [
        "Emergency mode toggle button is visible in the header",
        "Activating switches header and card borders to red accent theme",
        "Full-width red banner appears when mode is active",
        "Urgent/Unsafe donation cards sort to top in dashboard views",
        "Deactivating restores green/orange theme"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Implement bonus UX features: (1) Multi-language toggle in the header supporting English, Hindi (हिंदी), and Marathi (मराठी) — translate all static UI labels, button text, and headings using a simple i18n string map; (2) Dark mode toggle in the header that switches the Tailwind theme class on the root element; (3) Animated loading states (skeleton screens or spinner overlays) for all data-fetching operations; (4) Real-time toast notifications (using a lightweight toast system) for events: donation submitted, NGO matched, donation accepted/rejected, volunteer assigned.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Multi-language toggle (English / Hindi / Marathi)",
          "Dark mode",
          "Animated loading states",
          "Real-time toast notifications"
        ]
      },
      "acceptanceCriteria": [
        "Language toggle switches all static UI text to the selected language",
        "Hindi and Marathi translations are provided for all main labels and buttons",
        "Dark mode toggle applies dark background/light text theme across all pages",
        "Skeleton loaders appear during backend query loading states",
        "Toast notifications appear for donation submission, NGO match, accept/reject events"
      ]
    },
    {
      "id": "REQ-24",
      "text": "Apply a glassmorphism-forward visual redesign across all pages consistent with the hackathon theme. Use: soft green (#16a34a range) and warm orange (#ea7c2b range) as primary palette; frosted glass card style (backdrop-filter blur, semi-transparent white/dark backgrounds with border); smooth CSS transitions on hover and state changes (no Framer Motion dependency required, CSS transitions acceptable); mobile-responsive layout with flex/grid; floating micro-interactions on buttons (subtle scale/shadow on hover); food, location, and impact iconography via inline SVG or Lucide icons throughout all pages including Home, Donate Food, NGO Dashboard, Volunteer Dashboard, Impact Dashboard, and Admin Panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Soft green + orange",
          "Glassmorphism cards",
          "Smooth transitions",
          "Modern startup look",
          "Mobile responsive",
          "Floating micro-interactions",
          "Beautiful iconography"
        ]
      },
      "acceptanceCriteria": [
        "All cards use backdrop-filter blur with semi-transparent backgrounds",
        "Green and orange palette is applied consistently across all pages",
        "Hover states on buttons show scale and shadow transitions",
        "Layout is responsive and usable on mobile viewports (320px+)",
        "Food and impact icons are present on all major sections"
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add Volunteer role support to the backend. Extend the UserRole variant to include a Volunteer option. Create a VolunteerProfile type with fields: principal (Principal), name (Text), city (Text), active (Bool), availabilityStatus (Text). Add a registerVolunteer update function callable by Volunteer-role principals. Add a query to fetch the caller's own volunteer profile. Add a listVolunteerAssignments query that returns all Pending/Matched donations in the volunteer's city. Store volunteer profiles in a stable TrieMap keyed by principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Volunteer drivers",
          "Volunteer Dashboard",
          "Volunteer Smart Assignment"
        ]
      },
      "acceptanceCriteria": [
        "UserRole variant includes Volunteer",
        "VolunteerProfile type has all specified fields",
        "registerVolunteer stores profile linked to caller principal",
        "getMyVolunteerProfile query returns the caller's profile",
        "listVolunteerAssignments returns donations filtered by volunteer's city"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Extend the backend systemAnalytics endpoint to also return: totalVolunteers (count of active volunteer profiles), citywiseStats (array of {city: Text, totalKg: Float, donationCount: Nat} for each Maharashtra city), and co2SavedKg (totalKgRedistributed × 2.1). Store city on each donation record (Text field) so city-wise aggregation is possible. Update the donation submission endpoint to accept and store the donor's city.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "City-wise breakdown",
          "CO₂ saved",
          "systemAnalytics"
        ]
      },
      "acceptanceCriteria": [
        "Donation records store a city Text field",
        "submitDonation accepts city as a parameter",
        "systemAnalytics returns totalVolunteers, citywiseStats array, and co2SavedKg",
        "citywiseStats contains entries for each city present in donation data",
        "co2SavedKg = totalKgRedistributed × 2.1"
      ]
    }
  ],
  "constraints": [
    "All backend logic must remain in a single Motoko actor (backend/main.mo).",
    "No external AI APIs (OpenAI) — all AI logic (spoilage, matching, scoring) must be implemented as deterministic TypeScript (frontend) or Motoko (backend) rule-based logic.",
    "No Google Maps API integration — use OpenStreetMap iframe embeds or styled static map placeholders for route previews.",
    "No WebSocket or real-time push — toast notifications and updates must be driven by React Query polling or mutation callbacks.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Haversine distance calculation must be implemented in frontend TypeScript using the hardcoded NGO coordinate data specified in REQ-18."
  ],
  "nonGoals": [
    "No integration with Firebase, Supabase, or any external database.",
    "No OpenAI API or any third-party LLM API calls.",
    "No Google Maps JavaScript API (use OpenStreetMap or static placeholders only).",
    "No GPS/geolocation API (use city-based coordinate lookup from predefined Maharashtra city center coordinates).",
    "No SMS, push notification, or email service integrations.",
    "No Framer Motion dependency (CSS transitions are sufficient for animations).",
    "No actual real-time data — all counters and charts use seeded demo data derived from backend queries or hardcoded demo values."
  ],
  "imageRequirements": {
    "required": [
      "From Waste to Plate hero banner illustration: a warm-toned scene showing hands passing a food tray over a Maharashtra cityscape silhouette with green fields and orange sunset sky, modern flat illustration style (hero-banner.dim_1200x400.png)",
      "Impact dashboard background graphic: abstract green and orange wavy lines with food bowl and leaf motifs suggesting sustainability and abundance (impact-bg.dim_1200x400.png)",
      "Volunteer badge icon: a stylized running figure carrying a food box, in green and orange tones, flat icon style (volunteer-icon.dim_128x128.png)",
      "Emergency mode warning illustration: a red alert siren with a plate and fork symbol, flat vector style in red and dark tones (emergency-icon.dim_128x128.png)"
    ],
    "edits": [
      "Update the existing app logo to add 'Maharashtra Edition' subtitle text below the plate/arrow motif (logo.dim_256x256.png > logo-maharashtra.dim_256x256.png)"
    ]
  }
}